# Books (Core)

*Christina Brockway*

![png](Data/books.png)

## Imports and Connection Creation

In [1]:
import pandas as pd

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists,create_database
from urllib.parse import quote_plus as urlquote

In [2]:
import json
with open('/Users/csbro/.secret/mysql.json') as f:
    login = json.load(f)
login.keys()

dict_keys(['username', 'password'])

In [3]:
db_name = 'books'
conn = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/{db_name}"
engine = create_engine(conn)

In [4]:
#Check if db exists
if database_exists(conn):
    print("It exists!")
else:
    create_database(conn)
    print('Database created')

It exists!

In [5]:
#Preview names of tables
q ="""
SHOW TABLES;
"""
pd.read_sql(q,engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

## Show Empty Tables

In [6]:
q = """
SELECT * FROM authors;
"""
pd.read_sql(q, engine)

Empty DataFrame
Columns: [author_id, author_name, date_created, date_updated]
Index: []

In [7]:
q = """
SELECT * FROM books;
"""
pd.read_sql(q, engine)

Empty DataFrame
Columns: [book_id, title, date_created, date_updated, author_id]
Index: []

In [8]:
q = """
SELECT * FROM users;
"""
pd.read_sql(q, engine)

,user_id,first_name,last_name,email,date_created,date_updated
0,1,John,Doe,JD@books.com,2023-10-26 16:08:37,2023-10-26 16:08:37
1,2,Robin,Smith,Robin@books.com,2023-10-26 16:08:37,2023-10-26 16:08:37
2,3,Gloria,Rodriguez,grodriquez@books.com,2023-10-26 16:08:37,2023-10-26 16:08:37

In [9]:
q = """
SELECT * FROM favorites;
"""
pd.read_sql(q, engine)

Empty DataFrame
Columns: [user_id, book_id]
Index: []

## Import data into notebook

In [10]:
authors = pd.read_csv("Data/authors - authors.csv")
authors.info
authors.head()

   id        author_name
0   1       Stephen King
1   2  F.Scott Fitgerald
2   3        Jack London
3   4        Jane Austen
4   5       Mary Shelley

In [11]:
books = pd.read_csv("Data/books - books.csv")
books.info
books.head()

   id                 title  author_id
0   1           The Shining          1
1   2                    It          1
2   3      The Great Gatsby          2
3   4  The Call of the Wild          3
4   5   Pride and Prejudice          4

In [12]:
users = pd.read_csv("Data/users  - users.csv")
users.info
users.head()

   id first_name  last_name                 email
0   1       John        Doe          JD@books.com
1   2      Robin      Smith       Robin@books.com
2   3     Gloria  Rodriguez  grodriquez@books.com

In [13]:
favorites = pd.read_csv("Data/favorites - favorites.csv")
favorites.info
favorites.head()

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5

## Loading data into tables

### Authors

In [14]:
q = """
DESCRIBE authors;
"""
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,author_id,int,NO,PRI,None,auto_increment
1,author_name,varchar(45),YES,,None,
2,date_created,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,date_updated,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [15]:
#Check field names
describe['Field'].values

array(['author_id', 'author_name', 'date_created', 'date_updated'],
      dtype=object)

In [16]:
#Check dataframe's columns
authors.columns

Index(['id', 'author_name'], dtype='object')

In [33]:
rename_authors = {'id':'author_id'}
authors = authors.rename(rename_authors, axis = 1)
authors.head(1)

   author_id   author_name
0          1  Stephen King

In [17]:
#Review SQL table data types
describe [['Field', 'Type']]

          Field         Type
0     author_id          int
1   author_name  varchar(45)
2  date_created     datetime
3  date_updated     datetime

In [35]:
#Review dataframe data types
authors.dtypes

author_id       int64
author_name    object
dtype: object

In [36]:
# read data into authors
authors.to_sql('authors', engine, index=False, if_exists = 'append')

5

In [37]:
# Confirm data has been added
q = """
SELECT * FROM authors;
"""
pd.read_sql(q,engine)

   author_id        author_name        date_created        date_updated
0          1       Stephen King 2023-10-26 16:19:03 2023-10-26 16:19:03
1          2  F.Scott Fitgerald 2023-10-26 16:19:03 2023-10-26 16:19:03
2          3        Jack London 2023-10-26 16:19:03 2023-10-26 16:19:03
3          4        Jane Austen 2023-10-26 16:19:03 2023-10-26 16:19:03
4          5       Mary Shelley 2023-10-26 16:19:03 2023-10-26 16:19:03

### Books

In [19]:
q = """
DESCRIBE books;
"""
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,book_id,int,NO,PRI,None,auto_increment
1,title,varchar(45),YES,,None,
2,date_created,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
3,date_updated,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP
4,author_id,int,NO,MUL,None,

In [20]:
#Check field names
describe['Field'].values

array(['book_id', 'title', 'date_created', 'date_updated', 'author_id'],
      dtype=object)

In [39]:
#Check dataframe's columns
books.columns

Index(['id', 'title', 'author_id'], dtype='object')

In [40]:
rename_books = {'id':'book_id'}
books = books.rename(rename_books, axis = 1)
books.head(1)

   book_id        title  author_id
0        1  The Shining          1

In [22]:
#Review SQL table data types
describe [['Field', 'Type']]

          Field         Type
0       book_id          int
1         title  varchar(45)
2  date_created     datetime
3  date_updated     datetime
4     author_id          int

In [42]:
#Review dataframe data types
books.dtypes

book_id       int64
title        object
author_id     int64
dtype: object

In [43]:
# read data into authors
books.to_sql('books', engine, index=False, if_exists = 'append')

6

In [44]:
# Confirm data has been added
q = """
SELECT * FROM books;
"""
pd.read_sql(q,engine)

,book_id,title,date_created,date_updated,author_id
0,1,The Shining,2023-10-26 16:23:35,2023-10-26 16:23:35,1
1,2,It,2023-10-26 16:23:35,2023-10-26 16:23:35,1
2,3,The Great Gatsby,2023-10-26 16:23:35,2023-10-26 16:23:35,2
3,4,The Call of the Wild,2023-10-26 16:23:35,2023-10-26 16:23:35,3
4,5,Pride and Prejudice,2023-10-26 16:23:35,2023-10-26 16:23:35,4
5,6,Frankenstein,2023-10-26 16:23:35,2023-10-26 16:23:35,5

### Users

In [24]:
q = """
DESCRIBE users;
"""
describe = pd.read_sql(q, engine)
describe

,Field,Type,Null,Key,Default,Extra
0,user_id,int,NO,PRI,None,auto_increment
1,first_name,varchar(45),YES,,None,
2,last_name,varchar(45),YES,,None,
3,email,varchar(45),YES,,None,
4,date_created,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED
5,date_updated,datetime,YES,,CURRENT_TIMESTAMP,DEFAULT_GENERATED on update CURRENT_TIMESTAMP

In [25]:
#Check field names
describe['Field'].values

array(['user_id', 'first_name', 'last_name', 'email', 'date_created',
       'date_updated'], dtype=object)

In [26]:
#Check dataframe's columns
users.columns

Index(['id', 'first_name', 'last_name', 'email'], dtype='object')

In [27]:
rename_users = {'id':'user_id'}
users = users.rename(rename_users, axis = 1)
users.head(1)

   user_id first_name last_name         email
0        1       John       Doe  JD@books.com

In [28]:
#Review SQL table data types
describe [['Field', 'Type']]

          Field         Type
0       user_id          int
1    first_name  varchar(45)
2     last_name  varchar(45)
3         email  varchar(45)
4  date_created     datetime
5  date_updated     datetime

In [29]:
#Review dataframe data types
users.dtypes

user_id        int64
first_name    object
last_name     object
email         object
dtype: object

In [45]:
#Load Users table
users.to_sql("users", engine, index=False, if_exists='append')

IntegrityError: (pymysql.err.IntegrityError) (1062, "Duplicate entry '1' for key 'users.PRIMARY'")
[SQL: INSERT INTO users (user_id, first_name, last_name, email) VALUES (%(user_id)s, %(first_name)s, %(last_name)s, %(email)s)]
[parameters: ({'user_id': 1, 'first_name': 'John', 'last_name': 'Doe', 'email': 'JD@books.com'}, {'user_id': 2, 'first_name': 'Robin', 'last_name': 'Smith', 'email': 'Robin@books.com'}, {'user_id': 3, 'first_name': 'Gloria', 'last_name': 'Rodriguez', 'email': 'grodriquez@books.com'})]
(Background on this error at: https://sqlalche.me/e/14/gkpj)

In [46]:
# Confirm data has been added
q = """
SELECT * FROM users;
"""
pd.read_sql(q,engine)

,user_id,first_name,last_name,email,date_created,date_updated
0,1,John,Doe,JD@books.com,2023-10-26 16:08:37,2023-10-26 16:08:37
1,2,Robin,Smith,Robin@books.com,2023-10-26 16:08:37,2023-10-26 16:08:37
2,3,Gloria,Rodriguez,grodriquez@books.com,2023-10-26 16:08:37,2023-10-26 16:08:37

### Favorites

In [47]:
q = """
DESCRIBE favorites;
"""
describe = pd.read_sql(q, engine)
describe

     Field Type Null  Key Default Extra
0  user_id  int   NO  MUL    None
1  book_id  int   NO  MUL    None

In [48]:
#Check field names
describe['Field'].values

array(['user_id', 'book_id'], dtype=object)

In [49]:
#Check dataframe's columns
favorites.columns

Index(['user_id', 'book_id'], dtype='object')

In [50]:
#Review SQL table data types
describe [['Field', 'Type']]

     Field Type
0  user_id  int
1  book_id  int

In [51]:
#Review dataframe data types
favorites.dtypes

user_id    int64
book_id    int64
dtype: object

In [52]:
#Load Favorites table
favorites.to_sql("favorites", engine, index=False, if_exists='append')

7

In [53]:
# Confirm data has been added
q = """
SELECT * FROM favorites;
"""
pd.read_sql(q,engine)

   user_id  book_id
0        1        1
1        1        2
2        1        3
3        2        4
4        2        5
5        3        5
6        3        6

## Show Tables

In [54]:
#Check Database 
q ="""
SHOW TABLES;
"""
pd.read_sql(q,engine)

  Tables_in_books
0         authors
1           books
2       favorites
3           users

## Test query

In [58]:
q = """
SELECT books.title, favorites.user_id
FROM books
JOIN favorites ON books.book_id = favorites.book_id
WHERE favorites.user_id = 
    (SELECT users.user_id FROM users 
    WHERE (users.last_name = 'Doe' AND users.first_name = 'John'));
    """
pd.read_sql(q, engine)

              title  user_id
0       The Shining        1
1                It        1
2  The Great Gatsby        1